cf/DataProcessors/КурсыВалютЕЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КурсыВалютЕЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериодаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВалюты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/КурсыВалютЕЦБ/Ext/ObjectModule.bsl
// Процедура заполняет табличную часть списком валют. В список попадают только 
// валюты, курс которых не зависит от курса других валют.
//
Процедура ЗаполнитьСписокВалют() Экспорт
	
	СписокВалют.Очистить();
	
	ЗагружаемыеВалюты = РаботаСКурсамиВалют.ПолучитьМассивЗагружаемыхВалют();
	
	Для Каждого ЭлементВалюта Из ЗагружаемыеВалюты Цикл
		НоваяСтрока = СписокВалют.Добавить();
		НоваяСтрока.КодВалюты = ЭлементВалюта.Код;
		НоваяСтрока.Валюта    = ЭлементВалюта;
	КонецЦикла;
	
КонецПроцедуры

Функция ИзвлечСтроку(Строка)
	
	// Забирает значение строки и возвращает результат
	
	Поз 		= Найти(Строка, ",");
	Значение	= ЛеВ(Строка, Поз - 1);
	Строка 		= Сред(Строка, Поз + 1);
	
	Возврат Значение;
	
КонецФункции

// Загрузка круса долара по отношению к евро
//
Функция ЗагрузитьКурсыДолараКЕвро(стрОшибки = "") Экспорт
	
	// Получим файл с сервера
	
	НачалоУчета = '20130101';
	Результат 	= ПолучениеФайловИзИнтернет.СкачатьФайлНаСервере("http://www.ecb.europa.eu/stats/eurofxref/eurofxref-hist.zip");
	
	Если Результат.Статус Тогда
		
		// Разархивируем
		
		ПутьККаталогуНаСервере = КаталогВременныхФайлов();
		
		ЧтениеZIP = Новый ЧтениеZipФайла(Результат.Путь);
		ЧтениеZIP.ИзвлечьВсе(ПутьККаталогуНаСервере, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		ЧтениеZIP.Закрыть();
		
		УдалитьФайлы(Результат.Путь);
		
		// Считаем файл
		            
		Текст = Новый ЧтениеТекста(ПутьККаталогуНаСервере + "eurofxref-hist.csv", КодировкаТекста.ANSI);
		
		Долар = Справочники.Валюты.НайтиПоКоду("840");
		Набор = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		Набор.Отбор.Валюта.Установить(Долар);
		
		Текст.ПрочитатьСтроку(); // первая строка с полями
		Стр = Текст.ПрочитатьСтроку(); 
		Пока Стр <> Неопределено Цикл 
			
			Попытка		Период = Дата(СтрЗаменить(ИзвлечСтроку(Стр) ,"-",""));
			Исключение	Перейти ~КонецЦикла; КонецПопытки;
			
			Если Период >= НачалоУчета Тогда
			
				НовСтрока = Набор.Добавить();
				НовСтрока.Валюта 	= Долар;
				НовСтрока.Период 	= Период;
				НовСтрока.Курс 		= 1 / Число(ИзвлечСтроку(Стр)); 
				НовСтрока.Кратность = 1; КонецЕсли;
				
			~КонецЦикла: Стр = Текст.ПрочитатьСтроку(); КонецЦикла;
		
		УдалитьФайлы(Результат.Путь);
		
		// Загрузим в регистр
		
		Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Набор);
		
	Иначе
		
		стрОшибки = "Не удалось загрузить файл с сервера ЕЦБ";
		Возврат Ложь; КонецЕсли;
	
КонецФункции
